Hi, coworker here. I have more information that may help in triaging this issue to most accurately describe how we've encountered this behavior.

We created Custom Domain in Auth0 UI, and verified it first.

After, I made a GET call to the `/api/custom-domains` endpoint to get the ID of the resource, and created the same in our `terraform`:

API response:
<details>

```json
[
    {
        "custom_domain_id": "<SNIP ID>",
        "domain": "<FQDN SNIP>",
        "primary": true,
        "status": "ready",
        "tls_policy": "recommended",
        "type": "auth0_managed_certs",
        "verification": {
            "methods": [
                {
                    "name": "cname",
                    "record": "<PRIVATE SNIP>.edge.tenants.us.auth0.com"
                }
            ]
        }
    }
]
```

</details>

With the `id` value in hand, I did `terraform import module.auth0.auth0_custom_domain.login <SNIP ID>`, which resulted in the following addition to our state (from `terraform state show`):

<details>

```hcl
# module.auth0.auth0_custom_domain.login:
resource "auth0_custom_domain" "login" {
    domain       = "<FQDN SNIP>"
    id           = "<SNIP ID>"
    primary      = true
    status       = "ready"
    type         = "auth0_managed_certs"
    verification = [
        {
            methods = [
                {
                    "name"   = "cname"
                    "record" = "<PRIVATE SNIP>.edge.tenants.us.auth0.com"
                },
            ]
        },
    ]
}
```

</details>

Finally I tried `terraform plan` to verify the imported resource was successful and could cleanly apply:

<details>

```hcl
  # module.auth0.auth0_custom_domain.login must be replaced
-/+ resource "auth0_custom_domain" "login" {
        domain              = "<FQDN SNIP>"
      ~ id                  = "<SNIP ID>" -> (known after apply)
      ~ primary             = true -> (known after apply)
      ~ status              = "ready" -> (known after apply)
        type                = "auth0_managed_certs"
      ~ verification        = [
          - {
              - methods = [
                  - {
                      - "name"   = "cname"
                      - "record" = "<PRIVATE SNIP>.edge.tenants.us.auth0.com"
                    },
                ]
            },
        ] -> (known after apply)
      + verification_method = "txt" # forces replacement
    }
```

</details>

As shown, the `verification_method` field that is required per the provider docs is forcing replacement for the resource, possibly due to the field not being in state, or coming inbound from the API after validation has completed?

Presently to work around this, I've added a lifecycle ignore changes directive to the resource:

<details>

```hcl
resource "auth0_custom_domain" "login" {
  domain              = var.login_domain
  type                = "auth0_managed_certs"
  verification_method = "txt"

  lifecycle {
    ignore_changes = [
      # Ignore changes to verification_method
      # After verification, the verification_method is dropped
      verification_method
    ]
  }
}
```

</details>